src/mathematics/linear_algebra/KBrefInvariantSubspaces.org
#+TITLE: Invariant Subspaces
#+AUTHOR: Exr0n
* Axler 3.A                                                          :source:
* invariant subspace                                                    :def:
  #+begin_quote
  Suppose $T \in \mathcal L(V)$. A subpsace $U$ of $V$ is called /invariant/ under $T$ if $u \in U$ implies $Tu \in U$.
  #+end_quote
** intuit
   A subspace $U$ is called invariant on $T$ if $T\big|_U$ is closed in $U$. (BUT it is not nessecarily an operator!)
   Aka the map is closed under the subspace.
** results
*** finite dimensional subspaces of sufficiently large dimension (1 for $\mathbb F = \mathbb C$ and 2 for $\mathbb F = \mathbb R$)
