docs/math530/KBrefInvariantSubspaces.tex
% Created 2021-09-11 Sat 08:18
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Exr0n}
\date{\today}
\title{Invariant Subspaces}
\hypersetup{
 pdfauthor={Exr0n},
 pdftitle={Invariant Subspaces},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Axler 3.A\hfill{}\textsc{source}}
\label{sec:org46f6984}
\section{invariant subspace\hfill{}\textsc{def}}
\label{sec:orge058ddf}
\begin{quote}
Suppose \(T \in \mathcal L(V)\). A subpsace \(U\) of \(V\) is called \emph{invariant} under \(T\) if \(u \in U\) implies \(Tu \in U\).
\end{quote}
\subsection{intuit}
\label{sec:orgcec105e}
A subspace \(U\) is called invariant on \(T\) if \(T\big|_U\) is closed in \(U\). (BUT it is not nessecarily an operator!)
Aka the map is closed under the subspace.
\subsection{results}
\label{sec:org27cfd4e}
\subsubsection{finite dimensional subspaces of sufficiently large dimension (1 for \(\mathbb F = \mathbb C\) and 2 for \(\mathbb F = \mathbb R\))}
\label{sec:orgd563450}
\end{document}
